app/views/operadors/_reports.html.erb

					<td><%= rep.numero %></td>
					<td><%= Maquina.find(Arriendo.find(rep.arriendo_id).maquina_id).nombre + " ( " +
---
SELECT  `arriendos`.* FROM `arriendos` WHERE `arriendos`.`id` = 14 LIMIT 1
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1