organimaq/app/views/dashboards/index.html.erb

SELECT COUNT(*) FROM `maquinas` WHERE (estado_maquina_id=1)
SELECT `estado_maquinas`.* FROM `estado_maquinas`
---
//Flot Pie Chart
$(function() {

	<%
		EstadoMaquina.all.each do |e|
			Maquina.where("estado_maquina_id="+e.id.to_s).count
		 end
	%>
    var data = [{
        label: "Arrendadas",
        data: 6
    }, {
        label: "Series 1",
        data: 3
    }, {
        label: "Series 2",
        data: 9
    }, {
        label: "Series 3",
        data: 20
    }];
