organimaq/app/views/welcome/index.html.erb

SELECT COUNT(*) FROM `maquinas` WHERE (estado_maquina_id = 1)
---

<%= Maquina.where("estado_maquina_id = 1").count %>