organimaq/app/views/users/new.html.erb

SELECT  `tipo_users`.* FROM `tipo_users` WHERE `tipo_users`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
<% if current_user %>
	<% if TipoUser.find(current_user.tipo_user_id).nombre == 'Administrador' %>

SELECT `tipo_users`.* FROM `tipo_users`
---
			  <%= f.email_field :email %>
			  <%= f.collection_select :tipo_user_id, TipoUser.all, :id, :nombre %>