app/views/maquinas/show.html.erb

          <tr><td>Valor de Compra</td><td><%= @maquina.valor_compra %></td></tr>
          <tr><td>Tipo Máquina</td><td><%= TipoMaquina.find(@maquina.tipo_maquina_id).nombre %></td></tr>
          <tr><td>Estado de Máquina</td><td><%= EstadoMaquina.find(@maquina.estado_maquina_id).nombre %></td></tr>
---
SELECT  `tipo_maquinas`.* FROM `tipo_maquinas` WHERE `tipo_maquinas`.`id` = 1 LIMIT 1
SELECT  `estado_maquinas`.* FROM `estado_maquinas` WHERE `estado_maquinas`.`id` = 1 LIMIT 1