organimaq/app/views/carga_combustibles/new.html.erb

SELECT `fuente_combustibles`.* FROM `fuente_combustibles`
---

    <%= f.collection_select :fuente_combustible_id, FuenteCombustible.all, :id, :nombre %>