app/views/facturas/_facturas.html.erb

SELECT  `tipo_facturas`.* FROM `tipo_facturas` WHERE `tipo_facturas`.`id` = 1 LIMIT 1
SELECT  `proveedors`.* FROM `proveedors` WHERE `proveedors`.`id` = 2 LIMIT 1
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1
---
					<td><%= fac.neto %></td>
					<td><%= TipoFactura.find(fac.tipo_factura_id).nombre %></td>
					<td><%= Proveedor.find(fac.proveedor_id).nombre %></td>
					<td><%= Maquina.find(fac.maquina_id).nombre %></td>