app/views/facturas/show.html.erb

SELECT  `tipo_facturas`.* FROM `tipo_facturas` WHERE `tipo_facturas`.`id` = 1 LIMIT 1
SELECT  `proveedors`.* FROM `proveedors` WHERE `proveedors`.`id` = 2 LIMIT 1
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1
---
					<tr><td>Valor Neto</td><td><%= @factura.neto %></td></tr>
					<tr><td>Tipo Factura</td><td><%= TipoFactura.find(@factura.tipo_factura_id).nombre %></td></tr>
					<tr><td>Proveedor</td><td><%= Proveedor.find(@factura.proveedor_id).nombre %></td></tr>
					<tr><td>Maquina</td><td><%= Maquina.find(@factura.maquina_id).nombre %></td></tr>