organimaq/app/views/planificacions/_repuestos.html.erb

SELECT  `tipo_repuestos`.* FROM `tipo_repuestos` WHERE `tipo_repuestos`.`id` = 2 LIMIT 1
---
	  <td><%= repuesto.descripcion %></td>
	  <td><%= TipoRepuesto.find(repuesto.tipo_repuesto_id).nombre %></td>