organimaq/app/views/planificacions/index.html.erb


    		<%= link_to planificacion.descripcion + " (#{Maquina.find(planificacion.maquina_id).nombre})", edit_planificacion_path(planificacion), class: @clase %>
---
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1