organimaq/app/controllers/arriendos_controller.rb

  def index
	@search = Arriendo.ransack(params[:q])
	@arriendo = @search.result.paginate(page: params[:page], per_page:4)
---
SELECT  `arriendos`.* FROM `arriendos` LIMIT 4 OFFSET 0

  def show
	@arriendo = Arriendo.find(params[:id])

	@search = Report.joins('INNER JOIN arriendos ON arriendo_id = arriendos.id AND arriendos.id =', params[:id]).ransack(params[:q])
	@report = @search.result.paginate(page: params[:page], per_page:4)
---
SELECT  `arriendos`.* FROM `arriendos` WHERE `arriendos`.`id` = 14 LIMIT 1
SELECT `reports`.* FROM `reports` INNER JOIN arriendos ON arriendo_id = arriendos.id AND arriendos.id = 14 WHERE (fecha BETWEEN '2017-10-01' AND '2017-10-31')
SELECT  `reports`.* FROM `reports` INNER JOIN arriendos ON arriendo_id = arriendos.id AND arriendos.id = 14 LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `reports` INNER JOIN arriendos ON arriendo_id = arriendos.id AND arriendos.id = 14

  def create
  	@arriendo = Arriendo.new(arriendo_params)
  	if @arriendo.save
---
INSERT INTO `arriendos` (`fecha_arriendo`, `fecha_entrega`, `comentario`, `descuento`, `total_arriendo`, `nombre_faena`, `cliente_id`, `maquina_id`, `estado`, `created_at`, `updated_at`) VALUES ('2017-11-28', '2017-12-01', '', 0.0, 0, '', 10, 5, 'Abierta', '2017-11-28 16:03:05', '2017-11-28 16:03:05')