organimaq/app/controllers/carga_combustibles_controller.rb

  def new
	@carga = CargaCombustible.new
	@maquina = Maquina.find(params[:id])
---
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1

  def create
	@carga = CargaCombustible.new(carga_combustible_params)
	@carga.save
---
INSERT INTO `carga_combustibles` (`fecha`, `lugar`, `maquina_id`, `litros_cargados`, `horometro`, `kilometraje`, `numero_report`, `fuente_combustible_id`, `created_at`, `updated_at`) VALUES ('2017-11-28', 'Temuco', 1, 100.0, 455555, 1255555, 159753, 2, '2017-11-28 16:04:48', '2017-11-28 16:04:48')