organimaq/app/controllers/clientes_controller.rb

  def index
	@search = Cliente.ransack(params[:q])
	@cliente = @search.result.paginate(page: params[:page], per_page:4)
---
SELECT  `clientes`.* FROM `clientes` LIMIT 4 OFFSET 0

  def show
	@cliente = Cliente.find(params[:id])

	@search = Arriendo.joins('INNER JOIN clientes ON cliente_id = clientes.id AND clientes.id =', params[:id]).ransack(params[:q])
	@arriendos = @search.result.paginate(page: params[:page], per_page:4)
---
SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 10 LIMIT 1
SELECT  `arriendos`.* FROM `arriendos` INNER JOIN clientes ON cliente_id = clientes.id AND clientes.id = 10 LIMIT 4 OFFSET 0