organimaq/app/controllers/dashboards_controller.rb

  def index
	@maquinas = Maquina.all
	@estados = EstadoMaquina.all

	@emaq = @estados.map do |u|		# Crea el arreglo para los datos de json
		{:label => u.nombre, :value => Maquina.where("estado_maquina_id="+u.id.to_s).count}
	end


	@planificaciones = Planificacion.all


	@eplan = [{:label => "Cerrada", :value => Planificacion.where("estado='Cerrada'").count }, {:label => "Abierta", :value => Planificacion.where("estado='Abierta'").count }]
---
SELECT `maquinas`.* FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-04') <= 10 )
SELECT `estado_maquinas`.* FROM `estado_maquinas`
SELECT COUNT(*) FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-04') <= 10 )
SELECT `planificacions`.* FROM `planificacions` WHERE (fecha <= '2017-10-04' and estado = 'Abierta')
SELECT COUNT(*) FROM `planificacions` WHERE (fecha <= '2017-10-04' and estado = 'Abierta')