organimaq/app/controllers/maquinas_controller.rb

SELECT COUNT(*) FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-10') <= 10 )
SELECT `maquinas`.* FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-10') <= 10 )
---
	def index
		@search = Maquina.ransack(params[:q])
		@maquina = @search.result.paginate(page: params[:page], per_page:4)

SELECT `maquinas`.* FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-10') <= 10 )
SELECT  `carga_combustibles`.* FROM `carga_combustibles` INNER JOIN maquinas ON maquina_id=maquinas.id and maquinas.id= 6 LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `carga_combustibles` INNER JOIN maquinas ON maquina_id=maquinas.id and maquinas.id= 1
SELECT  `facturas`.* FROM `facturas` INNER JOIN maquinas ON maquina_id = maquinas.id AND maquinas.id = 6 LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `facturas` INNER JOIN maquinas ON maquina_id = maquinas.id AND maquinas.id = 1
---
	def show
		@maquina = Maquina.find(params[:id])

		@search_cargas =CargaCombustible.joins("INNER JOIN maquinas ON maquina_id=maquinas.id and maquinas.id=", params[:id]).ransack(params[:q_carga])
		@carga = @search_cargas.result.paginate(page: params[:page_cargas], per_page:4)

		@search = Factura.joins('INNER JOIN maquinas ON maquina_id = maquinas.id AND maquinas.id =', params[:id]).ransack(params[:q])
		@factura = @search.result.paginate(page: params[:page], per_page:4)

SELECT `maquinas`.* FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-04') <= 10 )
---
	def edit
		@maquina = Maquina.find(params[:id])

INSERT INTO `maquinas` (`nombre`, `codigo`, `chasis`, `motor`, `patente`, `marca`, `valor_hora`, `valor_dia`, `anio`, `foto`, `fecha_permiso`, `fecha_seguro`, `fecha_revision`, `horometro_actual`, `modelo`, `tipo_maquina_id`, `estado_maquina_id`, `created_at`, `updated_at`) VALUES ('maqq', '123', '2', '', '', '', 800, 1500, 188, 'retroexcavadora_214_jcb.jpg', '2017-10-18', '2017-10-21', '2017-10-21', 0, '', 1, 1, '2017-10-10 18:09:03', '2017-10-10 18:09:03')
---
	def create

		@maquina = Maquina.new(maquina_params);

		if @maquina.save

SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 2 LIMIT 1
UPDATE `maquinas` SET `fecha_permiso` = '2018-10-17', `fecha_seguro` = '2018-09-20', `fecha_revision` = '2018-09-13', `updated_at` = '2017-11-02 12:30:44' WHERE `maquinas`.`id` = 6
---
	def update
		@maquina = Maquina.find(params[:id])

		if @maquina.update(maquina_params)