organimaq/app/controllers/operadors_controller.rb

  def index
	@search = Operador.ransack(params[:q])
	@operador = @search.result.paginate(page: params[:page], per_page:4)
---
SELECT  `operadors`.* FROM `operadors` LIMIT 4 OFFSET 0

  def show
	@operador = Operador.find(params[:id])
	@infraction = Infraction.joins('INNER JOIN operadors ON operador_id = operadors.id AND operadors.id =', params[:id])

	# Busqueda y paginacion
	@search = Report.joins('INNER JOIN operadors ON operador_id = operadors.id AND operadors.id =', params[:id]).ransack(params[:q])
	@reports = @search.result.paginate(page: params[:page], per_page:4)
---
SELECT  `operadors`.* FROM `operadors` WHERE `operadors`.`id` = 4 LIMIT 1
SELECT `infractions`.* FROM `infractions` INNER JOIN operadors ON operador_id = operadors.id AND operadors.id = 4
SELECT  `reports`.* FROM `reports` INNER JOIN operadors ON operador_id = operadors.id AND operadors.id = 4 LIMIT 4 OFFSET 0