organimaq/app/controllers/orden_trabajos_controller.rb

INSERT INTO `orden_trabajos` (`planificacion_id`, `fecha`, `detalle`, `created_at`, `updated_at`) VALUES (7, '2017-11-30', 'Cambio Reten', '2017-11-28 15:41:16', '2017-11-28 15:41:16')
SELECT  `planificacions`.* FROM `planificacions` WHERE `planificacions`.`id` = 7 LIMIT 1
---
  def create

		@orden_trabajo = OrdenTrabajo.new(orden_trabajo_params);
		@orden_trabajo.save
		respond_modal_with @orden_trabajo, location: edit_planificacion_path(Planificacion.find(params[:orden_trabajo][:planificacion_id]))