organimaq/app/controllers/proveedors_controller.rb

  def index
	@search = Proveedor.ransack(params[:q])
	@proveedor = @search.result.paginate(page: params[:page], per_page:2)
---
SELECT  `proveedors`.* FROM `proveedors` LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM `proveedors`