organimaq/app/controllers/reports_controller.rb

SELECT  `arriendos`.* FROM `arriendos` WHERE `arriendos`.`id` = 14 LIMIT 1
SELECT `maquinas`.* FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-05') <= 10 )
---
  def new
	@report = Report.new
	@arriendo = Arriendo.find(params[:id])
	@maquina = Maquina.find(@arriendo.maquina_id)

SELECT  `reports`.* FROM `reports` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `reports`
---
  def index
	@search = Report.ransack(params[:q])
	@report = @search.result.paginate(page: params[:page], per_page:5)

SELECT  `reports`.* FROM `reports` WHERE `reports`.`id` = 55 LIMIT 1
---
  def show
	@report = Report.find(params[:id])

SELECT  `reports`.* FROM `reports` WHERE `reports`.`id` = 55 LIMIT 1
---
  def edit
	@report = Report.find(params[:id])

INSERT INTO `reports` (`nombre`, `fecha`, `horas`, `numero`, `arriendo_id`, `detalle`, `horometro_inicial`, `horometro_final`, `operador_id`, `km_inicio`, `km_final`, `created_at`, `updated_at`) VALUES ('222', '2017-10-04', 9, 222, 14, '', 45454545, 45455050, 5, 12343412, 12345000, '2017-10-06 18:34:53', '2017-10-06 18:34:53')
---
  def create
  	@report = Report.new(report_params)
  	if @report.save