organimaq/app/controllers/repuestos_planificacions_controller.rb

INSERT INTO `repuestos_planificacions` (`planificacion_id`, `repuesto_id`, `cantidad`, `created_at`, `updated_at`) VALUES (7, 2, 1, '2017-11-28 15:40:45', '2017-11-28 15:40:45')
SELECT  `planificacions`.* FROM `planificacions` WHERE `planificacions`.`id` = 7 LIMIT 1
---
  def create

		@repuestos_planificacions = RepuestosPlanificacion.new(repuestos_planificacion_params)
		@repuestos_planificacions.save
		respond_modal_with @repuestos_planificacions, location: edit_planificacion_path(Planificacion.find(params[:repuestos_planificacion][:planificacion_id]))