organimaq/app/controllers/users_controller.rb

INSERT INTO `users` (`usuario`, `nombre`, `email`, `tipo_user_id`, `password_salt`, `password_hash`, `created_at`, `updated_at`) VALUES ('abeltran', 'Alejandro Beltran', 'cristian15002002@gmail.com', 1, '$2a$10$s3qEc8aEzXCdV9rcbUs/Lu', '$2a$10$s3qEc8aEzXCdV9rcbUs/LuiZFpP4hrFpJQMCxJu/HwquAPEbvIoii', '2017-11-07 17:34:31', '2017-11-07 17:34:31')
---
  def create
	@user = User.new(user_params)
	if @user.save