app/views/planificacions/_facturas.html.erb

					<td><%= fac.neto %></td>
					<td><%= TipoFactura.find(fac.tipo_factura_id).nombre %></td>
					<td><%= Proveedor.find(fac.proveedor_id).nombre %></td>
---
SELECT  `tipo_facturas`.* FROM `tipo_facturas` WHERE `tipo_facturas`.`id` = 1 LIMIT 1
SELECT  `proveedors`.* FROM `proveedors` WHERE `proveedors`.`id` = 4 LIMIT 1