app/views/planificacions/new.html.erb


    <%= f.collection_select :maquina_id, Maquina.all, :id, :nombre %>

    <%= f.collection_select :estado_maquina_id, EstadoMaquina.all, :id, :nombre %>
---
SELECT `maquinas`.* FROM `maquinas`
SELECT `estado_maquinas`.* FROM `estado_maquinas`