app/views/planificacions/show.html.erb

SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 3 LIMIT 1
---

        <tr><th>Maquina</th><td><%= Maquina.find(@planificacion.maquina_id).nombre %></td></tr>