organimaq/app/views/partials/_barbar.html.erb

SELECT  `tipo_users`.* FROM `tipo_users` WHERE `tipo_users`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
		<% if current_user %>
			<li><b><%= current_user.usuario %> </b>( <%= TipoUser.find(current_user.tipo_user_id).nombre %> )</li>