organimaq/app/views/partials/_topbar.html.erb

SELECT COUNT(*) FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-04') <= 10 )
SELECT COUNT(*) FROM `planificacions` WHERE (fecha <= '2017-10-04' and estado = 'Abierta')
SELECT COUNT(*) FROM `repuestos` WHERE (stock < 3)
SELECT `maquinas`.* FROM `maquinas` WHERE (DATEDIFF(fecha_revision,'2017-10-04') <= 10 )
---

@notificaciones = Planificacion.where("fecha <= '"+Date.today.to_s+"' and estado = 'Abierta'").count + Repuesto.where("stock < 3").count + Maquina.where("DATEDIFF(fecha_permiso,'"+Date.today.to_s+"') <= 10 ").count + Maquina.where("DATEDIFF(fecha_seguro,'"+Date.today.to_s+"') <= 10 ").count + Maquina.where("DATEDIFF(fecha_revision,'"+Date.today.to_s+"') <= 10 ").count

SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 5 LIMIT 1
---
								<div>
									<i class="fa fa-exclamation-circle"></i>Planificacion de <b><%= Maquina.find(pl.maquina_id).nombre %></b>