organimaq/app/views/repuestos_planificacions/new.html.erb


			<%= f.collection_select :repuesto_id, Repuesto.all, :id, :nombre %>
---
SELECT `repuestos`.* FROM `repuestos`