organimaq/app/views/reports/_reports.html.erb

SELECT  `operadors`.* FROM `operadors` WHERE `operadors`.`id` = 5 LIMIT 1
SELECT  `arriendos`.* FROM `arriendos` WHERE `arriendos`.`id` = 14 LIMIT 1
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1
---
					<td><%= report.arriendo_id %></td>
					<td><%= Operador.find(report.operador_id).nombre %> <%= Operador.find(report.operador_id).apellido_p %> </td>
					<td><%= Maquina.find(Arriendo.find(report.arriendo_id).maquina_id).nombre %></td>