organimaq/app/views/reports/new.html.erb


		<%= f.collection_select :operador_id, Operador.all, :id, :nombre %>
---
SELECT `operadors`.* FROM `operadors`