app/controllers/facturas_controller.rb

SELECT  `facturas`.* FROM `facturas` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `facturas`
---
  def index
	@search = Factura.ransack(params[:q])
	@factura = @search.result.paginate(page: params[:page], per_page:5)

SELECT  `tipo_facturas`.* FROM `tipo_facturas` WHERE `tipo_facturas`.`id` = 1 LIMIT 1
---
  def show
	@factura = Factura.find(params[:id])

INSERT INTO `facturas` (`numero`, `descripcion`, `fecha`, `total`, `maquina_id`, `tipo_factura_id`, `proveedor_id`, `neto`, `created_at`, `updated_at`) VALUES ('155', '', '2017-12-01', 1190, 3, 1, 4, 1000, '2017-11-28 15:59:17', '2017-11-28 15:59:17')
INSERT INTO `planificacion_facturas` (`planificacion_id`, `factura_id`, `created_at`, `updated_at`) VALUES (12, 28, '2017-11-28 15:59:17', '2017-11-28 15:59:17')
---
  def create
  	@factura = Factura.new(factura_params)

	if $plan_id != nil
		@factura.save		# guarda la factura
		@plani = PlanificacionFactura.new(planificacion_id: $plan_id, factura_id: @factura.id)	# Crea objeto de la tabla relacion
		@plani.save