app/controllers/planificacions_controller.rb

SELECT `planificacions`.* FROM `planificacions` WHERE (fecha <= '2017-10-18' and estado = 'Abierta')
---
  def index
    @planificacions = Planificacion.all

SELECT `planificacions`.* FROM `planificacions` WHERE (fecha <= '2017-10-31' and estado = 'Abierta')
---
  def show
    @planificacion = Planificacion.find(params[:id])

SELECT `planificacions`.* FROM `planificacions` WHERE (fecha <= '2017-10-18' and estado = 'Abierta')
SELECT `mecanicos`.* FROM `mecanicos` INNER JOIN mecanicos_planificacions on mecanico_id = mecanicos.id AND planificacion_id = 10
SELECT  `repuestos`.* FROM `repuestos` INNER JOIN repuestos_planificacions on repuesto_id = repuestos.id AND planificacion_id = 10 LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM `repuestos` WHERE (stock < 3)
SELECT `repuestos_planificacions`.* FROM `repuestos_planificacions` INNER JOIN repuestos on repuesto_id = repuestos.id AND planificacion_id = 7
SELECT `orden_trabajos`.* FROM `orden_trabajos` WHERE (planificacion_id =10)
SELECT  `facturas`.* FROM `facturas` INNER JOIN planificacion_facturas on factura_id = facturas.id AND planificacion_id = 10 LIMIT 2 OFFSET 0
---
  def edit
    @planificacion = Planificacion.find(params[:id])
	# lista de mecanicos agregados a la planificacion
	@mecanico = Mecanico.joins("INNER JOIN mecanicos_planificacions on mecanico_id = mecanicos.id AND planificacion_id = ", params[:id])
	@pla = MecanicosPlanificacion.joins("INNER JOIN mecanicos on mecanico_id = mecanicos.id AND planificacion_id = ", params[:id])

	@search = Repuesto.joins("INNER JOIN repuestos_planificacions on repuesto_id = repuestos.id AND planificacion_id = ", params[:id]).ransack(params[:q])
	@repuestos = @search.result.paginate(page: params[:page], per_page:4)
	@RepuestoPla = RepuestosPlanificacion.joins("INNER JOIN repuestos on repuesto_id = repuestos.id AND planificacion_id = ", params[:id])

	@orden_trabajos = OrdenTrabajo.where("planificacion_id ="+params[:id])


	@search_factura = Factura.joins("INNER JOIN planificacion_facturas on factura_id = facturas.id AND planificacion_id =", params[:id]).ransack(params[:q])

	@facturas = @search_factura.result.paginate(page: params[:page_facturas], per_page:2)

INSERT INTO `planificacions` (`descripcion`, `estado`, `tipo`, `horometro`, `kilometraje`, `taller_externo`, `factura_pendiente`, `fecha`, `maquina_id`, `estado_maquina_id`, `created_at`, `updated_at`) VALUES ('Cambio de ', 'Abierta', 'Mantencion', 8888, 1254555, 'NO', 'NO', '2017-11-03', 3, 2, '2017-10-31 14:22:39', '2017-10-31 14:22:39')
---
  def create
    @planificacion = Planificacion.new(planificacion_params)
    if @planificacion.save

SELECT  `planificacions`.* FROM `planificacions` WHERE `planificacions`.`id` = 11 LIMIT 1
UPDATE `planificacions` SET `fecha` = '2017-11-30', `updated_at` = '2017-11-23 14:24:41' WHERE `planificacions`.`id` = 11
---
  def update
    @planificacion = Planificacion.find(params[:id])

    if @planificacion.update(planificacion_params)