organimaq/app/views/facturas/new.html.erb

SELECT `tipo_facturas`.* FROM `tipo_facturas`
SELECT `proveedors`.* FROM `proveedors`
---
	<%= f.number_field :total %>
    <%= f.collection_select :tipo_factura_id, TipoFactura.all, :id, :nombre %>
	<%= f.collection_select :proveedor_id, Proveedor.all, :id, :nombre %>