organimaq/app/views/maquinas/_maquinas.html.erb

          <td><%= maquina.nombre %></td>
          <td><%= TipoMaquina.find(maquina.tipo_maquina_id).nombre %></td>
          <td><%= EstadoMaquina.find(maquina.estado_maquina_id).nombre %></td>
---
SELECT  `tipo_maquinas`.* FROM `tipo_maquinas` WHERE `tipo_maquinas`.`id` = 1 LIMIT 1
SELECT  `estado_maquinas`.* FROM `estado_maquinas` WHERE `estado_maquinas`.`id` = 1 LIMIT 1