organimaq/app/views/maquinas/new.html.erb

SELECT `tipo_maquinas`.* FROM `tipo_maquinas`
SELECT `estado_maquinas`.* FROM `estado_maquinas`
---
    <%= f.text_field :nombre, :required => true %>
    <%= f.collection_select :tipo_maquina_id, TipoMaquina.all, :id, :nombre %>

    <%= f.collection_select :estado_maquina_id, EstadoMaquina.all, :id, :nombre %>