organimaq/app/views/arriendos/_arriendos.html.erb

					<td><%= arriendo.comuna_id %></td>
					<td><%= Cliente.find(arriendo.cliente_id).nombre %></td>
					<td><%= Maquina.find(arriendo.maquina_id).nombre %></td>
---
SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 10 LIMIT 1
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1