organimaq/app/views/arriendos/_reports.html.erb

			  <td><%= report.detalle  %></td>
			  <td><%= Operador.find(report.operador_id).nombre%> <%=Operador.find(report.operador_id).apellido_p  %></td>
---
SELECT  `operadors`.* FROM `operadors` WHERE `operadors`.`id` = 5 LIMIT 1