organimaq/app/views/arriendos/new.html.erb

SELECT `maquinas`.* FROM `maquinas`
SELECT `clientes`.* FROM `clientes`
---
		<%= f.select :estado, [["Facturado"], ["Abierta"], ["No Facturado"]], { label: "Estado" }, { class: "selectpicker" } %>
		<%= f.collection_select :maquina_id, Maquina.all, :id, :nombre, :required => true %>
		<%= f.collection_select :cliente_id, Cliente.all, :id, :nombre, :required => true %>