organimaq/app/views/arriendos/show.html.erb

SELECT  `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 10 LIMIT 1
SELECT  `maquinas`.* FROM `maquinas` WHERE `maquinas`.`id` = 1 LIMIT 1
---
					<tr><td>Comuna</td><td><%= @arriendo.comuna_id %></td></tr>
					<tr><td>Cliente</td><td><%= Cliente.find(@arriendo.cliente_id).nombre %></td></tr>
					<tr><td>Máquina</td><td><%= Maquina.find(@arriendo.maquina_id).nombre %></td></tr>